In [2]:
#importing the libraries
import pandas as pd
import numpy as np

In [3]:
#loading the dataset
biopics= pd.read_csv (r'C:\Users\COSEKE\Desktop\AI&ML\biopics.csv',encoding = "ISO-8859-1", engine='python')

In [4]:
biopics.head()

,title,country,year_release,box_office,type_of_subject,lead_actor_actress
0,10 Rillington Place,UK,1971,NaN,Criminal,Richard Attenborough
1,12 Years a Slave,US/UK,2013,56700000.0,Other,Chiwetel Ejiofor
2,127 Hours,US/UK,2010,18300000.0,Athlete,James Franco
3,1987,Canada,2014,NaN,Other,Jean-Carl Boucher
4,20 Dates,US,1998,537000.0,Other,Myles Berkowitz

In [5]:
biopics.tail(10)

,title,country,year_release,box_office,type_of_subject,lead_actor_actress
753,Words and Music,US,1948,NaN,Musician,Tom Drake
754,Wyatt Earp,US,1994,25100000.0,Other,Kevin Costner
755,Yankee Doodle Dandy,US,1942,NaN,Musician,James Cagney
756,Young Bess,US,1953,NaN,Historical,Jean Simmons
757,Young Cassidy,UK,1965,NaN,Author,Rod Taylor
758,Young Man with a Horn,US,1950,NaN,Musician,Kirk Douglas
759,Young Mr. Lincoln,US,1939,NaN,World leader,Henry Fonda
760,Young Tom Edison,US,1940,NaN,Other,Mickey Rooney
761,Young Winston,US,1972,NaN,World leader,Simon Ward
762,Your Cheatin' Heart,US,1964,NaN,Musician,George Hamilton

In [6]:
#data shape
biopics.shape

(763, 6)

In [7]:
#checking for duplicated rows
biopics.duplicated().sum()

5

In [8]:
#filtering out duplicated rows
biopics.sort_values("title", inplace = True)

biopics.drop_duplicates(subset ="title",
                     keep = False, inplace = True)
biopics

,title,country,year_release,box_office,type_of_subject,lead_actor_actress
0,10 Rillington Place,UK,1971,NaN,Criminal,Richard Attenborough
1,12 Years a Slave,US/UK,2013,56700000.0,Other,Chiwetel Ejiofor
2,127 Hours,US/UK,2010,18300000.0,Athlete,James Franco
3,1987,Canada,2014,NaN,Other,Jean-Carl Boucher
4,20 Dates,US,1998,537000.0,Other,Myles Berkowitz
...,...,...,...,...,...,...
759,Young Mr. Lincoln,US,1939,NaN,World leader,Henry Fonda
760,Young Tom Edison,US,1940,NaN,Other,Mickey Rooney
761,Young Winston,US,1972,NaN,World leader,Simon Ward
762,Your Cheatin' Heart,US,1964,NaN,Musician,George Hamilton
293,iSteve,US,2013,NaN,Other,Justin Long

In [9]:
#lets check if the duplicates are filtered out
biopics.duplicated().sum()

0

In [11]:
#renaming  the variable box_office to earnings
biopics_df= biopics.rename(columns={'box_office': 'earnings'})
biopics_df

,title,country,year_release,earnings,type_of_subject,lead_actor_actress
0,10 Rillington Place,UK,1971,NaN,Criminal,Richard Attenborough
1,12 Years a Slave,US/UK,2013,56700000.0,Other,Chiwetel Ejiofor
2,127 Hours,US/UK,2010,18300000.0,Athlete,James Franco
3,1987,Canada,2014,NaN,Other,Jean-Carl Boucher
4,20 Dates,US,1998,537000.0,Other,Myles Berkowitz
...,...,...,...,...,...,...
759,Young Mr. Lincoln,US,1939,NaN,World leader,Henry Fonda
760,Young Tom Edison,US,1940,NaN,Other,Mickey Rooney
761,Young Winston,US,1972,NaN,World leader,Simon Ward
762,Your Cheatin' Heart,US,1964,NaN,Musician,George Hamilton
293,iSteve,US,2013,NaN,Other,Justin Long

In [12]:
#filter out rows for which earnings are missing
biopics_df.dropna(subset=['earnings'],inplace=True)

biopics_df

,title,country,year_release,earnings,type_of_subject,lead_actor_actress
1,12 Years a Slave,US/UK,2013,56700000.0,Other,Chiwetel Ejiofor
2,127 Hours,US/UK,2010,18300000.0,Athlete,James Franco
4,20 Dates,US,1998,537000.0,Other,Myles Berkowitz
5,21,US,2008,81200000.0,Other,Jim Sturgess
6,24 Hour Party People,UK,2002,1130000.0,Musician,Steve Coogan
...,...,...,...,...,...,...
745,Wilde,UK,1997,2160000.0,Author,Stephen Fry
746,Wilson,US,1944,2000000.0,World leader,Alexander Knox
748,Wired,US,1989,1090000.0,Comedian,Michael Chiklis
750,Without Limits,US,1998,777000.0,Athlete,Billy Crudup
754,Wyatt Earp,US,1994,25100000.0,Other,Kevin Costner

In [16]:
#keep only movies  released in year 1990 or later
biopics_df= biopics_df[biopics_df['year_release']>=1990]
#riders = riders[riders['active_rider_age'] <70]
biopics_df['year_release'].value_counts()

2014    22
2013    22
2006    20
2007    17
2008    15
2005    13
2004    13
2009    12
2010    12
1993    12
2003    12
2000    10
1998    10
1997    10
1995    10
1994     9
1999     9
1992     8
2001     8
1996     8
2002     7
2011     7
2012     4
1991     2
Name: year_release, dtype: int64

In [17]:
biopics_df.head(20)

,title,country,year_release,earnings,type_of_subject,lead_actor_actress
1,12 Years a Slave,US/UK,2013,56700000.0,Other,Chiwetel Ejiofor
2,127 Hours,US/UK,2010,18300000.0,Athlete,James Franco
4,20 Dates,US,1998,537000.0,Other,Myles Berkowitz
5,21,US,2008,81200000.0,Other,Jim Sturgess
6,24 Hour Party People,UK,2002,1130000.0,Musician,Steve Coogan
7,42,US,2013,95000000.0,Athlete,Chadwick Boseman
8,8 Seconds,US,1994,19600000.0,Athlete,Luke Perry
11,A Beautiful Mind,US,2001,171000000.0,Academic,Russell Crowe
15,A Home of Our Own,US,1993,1700000.0,Other,Kathy Bates
26,Against the Ropes,US,2004,5880000.0,Athlete,Meg Ryan
28,Alexander,US/UK,2004,34300000.0,Historical,Colin Farrell
30,Ali,US,2001,58200000.0,Athlete,Will Smith
31,Alpha Dog,US,2006,15200000.0,Criminal,Emile Hirsch
34,Amazing Grace,US/UK,2006,21200000.0,Other,Ioan Gruffudd
35,Amelia,US/Canada,2009,14200000.0,Other,Hilary Swank
36,American Gangster,US/UK,2007,130000000.0,Criminal,Denzel Washington
37,American Me,US,1992,13100000.0,Criminal,Edward James Olmos
38,American Sniper,US,2014,350000000.0,Military,Bradley Cooper
39,American Splendor,US,2003,6000000.0,Comedian,Paul Giamatti
48,Antwone Fisher,US,2002,21100000.0,Military,Derek Luke

In [18]:
biopics_df.dtypes

title                  object
country                object
year_release            int64
earnings              float64
type_of_subject        object
lead_actor_actress     object
dtype: object

In [26]:
#creating a new variable called lead_actor_actress_known that is False if lead_actor_actress is NaN and True of otherwise
def f(row):
    if row['lead_actor_actress'] == "NaN":
        lead_actor_actress_known = False
    else:
         lead_actor_actress_known = True
    return  lead_actor_actress_known

In [27]:
biopics_df['lead_actor_actress_known'] = biopics_df.apply(f, axis=1)
biopics_df

,title,country,year_release,earnings,type_of_subject,lead_actor_actress,lead_actor_actress_known
1,12 Years a Slave,US/UK,2013,56700000.0,Other,Chiwetel Ejiofor,True
2,127 Hours,US/UK,2010,18300000.0,Athlete,James Franco,True
4,20 Dates,US,1998,537000.0,Other,Myles Berkowitz,True
5,21,US,2008,81200000.0,Other,Jim Sturgess,True
6,24 Hour Party People,UK,2002,1130000.0,Musician,Steve Coogan,True
...,...,...,...,...,...,...,...
743,Wild,US,2014,37900000.0,Other,Reese Witherspoon,True
744,Wild Bill,US,1995,2170000.0,Historical,Jeff Bridges,True
745,Wilde,UK,1997,2160000.0,Author,Stephen Fry,True
750,Without Limits,US,1998,777000.0,Athlete,Billy Crudup,True
754,Wyatt Earp,US,1994,25100000.0,Other,Kevin Costner,True

In [29]:
#reordering the columns 
biopics_new=biopics_df[['title','year_release','earnings','country','type_of_subject',
                        'lead_actor_actress','lead_actor_actress_known']]
biopics_new

,title,year_release,earnings,country,type_of_subject,lead_actor_actress,lead_actor_actress_known
1,12 Years a Slave,2013,56700000.0,US/UK,Other,Chiwetel Ejiofor,True
2,127 Hours,2010,18300000.0,US/UK,Athlete,James Franco,True
4,20 Dates,1998,537000.0,US,Other,Myles Berkowitz,True
5,21,2008,81200000.0,US,Other,Jim Sturgess,True
6,24 Hour Party People,2002,1130000.0,UK,Musician,Steve Coogan,True
...,...,...,...,...,...,...,...
743,Wild,2014,37900000.0,US,Other,Reese Witherspoon,True
744,Wild Bill,1995,2170000.0,US,Historical,Jeff Bridges,True
745,Wilde,1997,2160000.0,UK,Author,Stephen Fry,True
750,Without Limits,1998,777000.0,US,Athlete,Billy Crudup,True
754,Wyatt Earp,1994,25100000.0,US,Other,Kevin Costner,True

In [32]:
#sort the rows in descending order by earnings
biopics_sorted = biopics_new.sort_values(by ='earnings', ascending = 0)
#print("Sorting rows by earnings:\n \n", biopics_sorted)
biopics_sorted

,title,year_release,earnings,country,type_of_subject,lead_actor_actress,lead_actor_actress_known
38,American Sniper,2014,350000000.0,US,Military,Bradley Cooper,True
547,The Blind Side,2009,256000000.0,US,Athlete,Quinton Aaron,True
334,Lincoln,2012,182000000.0,US,World leader,Daniel Day-Lewis,True
11,A Beautiful Mind,2001,171000000.0,US,Academic,Russell Crowe,True
124,Catch Me If You Can,2002,164000000.0,US/Canada,Criminal,Leonardo DiCaprio,True
...,...,...,...,...,...,...,...
616,The Last Time I Committed Suicide,1997,12800.0,US,Author,Thomas Jane,True
624,The Look of Love,2013,10400.0,US/UK,Other,Steve Coogan,True
183,Ed Gein,2000,5710.0,US/UK,Criminal,Steve Railsback,True
314,Kid Cannabis,2014,5570.0,US,Criminal,Jonathan Daniel Brown,True
485,Set Fire to the Stars,2014,3270.0,UK,Author (poet),Celyn Jones,True